; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-6-6)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	p0-1 - location
	p0-3 - location
	p1-4 - location
	p1-6 - location
	p1-9 - location
	p3-0 - location
	p3-5 - location
	p3-8 - location
	p3-10 - location
	p4-0 - location
	p4-6 - location
	p5-2 - location
	p5-3 - location
	p5-6 - location
	p5-7 - location
	p5-10 - location
	p5-12 - location
	p6-8 - location
	p6-9 - location
	p7-11 - location
	p8-1 - location
	p8-12 - location
	p9-2 - location
	p10-8 - location
	p10-9 - location
	p10-12 - location
	)
	(:init
	(at driver1 s7)
	(at driver2 s5)
	(at driver3 s11)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s6)
	(empty truck2)
	(at truck3 s8)
	(empty truck3)
	(at truck4 s4)
	(empty truck4)
	(at truck5 s12)
	(empty truck5)
	(at truck6 s4)
	(empty truck6)
	(at package1 s11)
	(at package2 s7)
	(at package3 s6)
	(at package4 s9)
	(at package5 s6)
	(at package6 s9)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 50)
	(= (time-to-walk p0-1 s0) 50)
	(= (time-to-walk s1 p0-1) 43)
	(= (time-to-walk p0-1 s1) 43)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 43)
	(= (time-to-walk p0-3 s0) 43)
	(= (time-to-walk s3 p0-3) 55)
	(= (time-to-walk p0-3 s3) 55)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 76)
	(= (time-to-walk p1-4 s1) 76)
	(= (time-to-walk s4 p1-4) 88)
	(= (time-to-walk p1-4 s4) 88)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(= (time-to-walk s1 p1-6) 26)
	(= (time-to-walk p1-6 s1) 26)
	(= (time-to-walk s6 p1-6) 68)
	(= (time-to-walk p1-6 s6) 68)
	(path s1 p1-9)
	(path p1-9 s1)
	(path s9 p1-9)
	(path p1-9 s9)
	(= (time-to-walk s1 p1-9) 69)
	(= (time-to-walk p1-9 s1) 69)
	(= (time-to-walk s9 p1-9) 37)
	(= (time-to-walk p1-9 s9) 37)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 5)
	(= (time-to-walk p3-5 s3) 5)
	(= (time-to-walk s5 p3-5) 85)
	(= (time-to-walk p3-5 s5) 85)
	(path s3 p3-8)
	(path p3-8 s3)
	(path s8 p3-8)
	(path p3-8 s8)
	(= (time-to-walk s3 p3-8) 57)
	(= (time-to-walk p3-8 s3) 57)
	(= (time-to-walk s8 p3-8) 95)
	(= (time-to-walk p3-8 s8) 95)
	(path s3 p3-10)
	(path p3-10 s3)
	(path s10 p3-10)
	(path p3-10 s10)
	(= (time-to-walk s3 p3-10) 27)
	(= (time-to-walk p3-10 s3) 27)
	(= (time-to-walk s10 p3-10) 9)
	(= (time-to-walk p3-10 s10) 9)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 52)
	(= (time-to-walk p4-0 s4) 52)
	(= (time-to-walk s0 p4-0) 26)
	(= (time-to-walk p4-0 s0) 26)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(= (time-to-walk s4 p4-6) 65)
	(= (time-to-walk p4-6 s4) 65)
	(= (time-to-walk s6 p4-6) 99)
	(= (time-to-walk p4-6 s6) 99)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 64)
	(= (time-to-walk p5-2 s5) 64)
	(= (time-to-walk s2 p5-2) 86)
	(= (time-to-walk p5-2 s2) 86)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(= (time-to-walk s5 p5-6) 75)
	(= (time-to-walk p5-6 s5) 75)
	(= (time-to-walk s6 p5-6) 89)
	(= (time-to-walk p5-6 s6) 89)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(= (time-to-walk s5 p5-7) 81)
	(= (time-to-walk p5-7 s5) 81)
	(= (time-to-walk s7 p5-7) 27)
	(= (time-to-walk p5-7 s7) 27)
	(path s5 p5-10)
	(path p5-10 s5)
	(path s10 p5-10)
	(path p5-10 s10)
	(= (time-to-walk s5 p5-10) 17)
	(= (time-to-walk p5-10 s5) 17)
	(= (time-to-walk s10 p5-10) 27)
	(= (time-to-walk p5-10 s10) 27)
	(path s5 p5-12)
	(path p5-12 s5)
	(path s12 p5-12)
	(path p5-12 s12)
	(= (time-to-walk s5 p5-12) 97)
	(= (time-to-walk p5-12 s5) 97)
	(= (time-to-walk s12 p5-12) 93)
	(= (time-to-walk p5-12 s12) 93)
	(path s6 p6-8)
	(path p6-8 s6)
	(path s8 p6-8)
	(path p6-8 s8)
	(= (time-to-walk s6 p6-8) 3)
	(= (time-to-walk p6-8 s6) 3)
	(= (time-to-walk s8 p6-8) 47)
	(= (time-to-walk p6-8 s8) 47)
	(path s6 p6-9)
	(path p6-9 s6)
	(path s9 p6-9)
	(path p6-9 s9)
	(= (time-to-walk s6 p6-9) 36)
	(= (time-to-walk p6-9 s6) 36)
	(= (time-to-walk s9 p6-9) 46)
	(= (time-to-walk p6-9 s9) 46)
	(path s7 p7-11)
	(path p7-11 s7)
	(path s11 p7-11)
	(path p7-11 s11)
	(= (time-to-walk s7 p7-11) 2)
	(= (time-to-walk p7-11 s7) 2)
	(= (time-to-walk s11 p7-11) 11)
	(= (time-to-walk p7-11 s11) 11)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(= (time-to-walk s8 p8-1) 33)
	(= (time-to-walk p8-1 s8) 33)
	(= (time-to-walk s1 p8-1) 27)
	(= (time-to-walk p8-1 s1) 27)
	(path s8 p8-12)
	(path p8-12 s8)
	(path s12 p8-12)
	(path p8-12 s12)
	(= (time-to-walk s8 p8-12) 79)
	(= (time-to-walk p8-12 s8) 79)
	(= (time-to-walk s12 p8-12) 2)
	(= (time-to-walk p8-12 s12) 2)
	(path s9 p9-2)
	(path p9-2 s9)
	(path s2 p9-2)
	(path p9-2 s2)
	(= (time-to-walk s9 p9-2) 64)
	(= (time-to-walk p9-2 s9) 64)
	(= (time-to-walk s2 p9-2) 83)
	(= (time-to-walk p9-2 s2) 83)
	(path s10 p10-8)
	(path p10-8 s10)
	(path s8 p10-8)
	(path p10-8 s8)
	(= (time-to-walk s10 p10-8) 87)
	(= (time-to-walk p10-8 s10) 87)
	(= (time-to-walk s8 p10-8) 21)
	(= (time-to-walk p10-8 s8) 21)
	(path s10 p10-9)
	(path p10-9 s10)
	(path s9 p10-9)
	(path p10-9 s9)
	(= (time-to-walk s10 p10-9) 77)
	(= (time-to-walk p10-9 s10) 77)
	(= (time-to-walk s9 p10-9) 13)
	(= (time-to-walk p10-9 s9) 13)
	(path s10 p10-12)
	(path p10-12 s10)
	(path s12 p10-12)
	(path p10-12 s12)
	(= (time-to-walk s10 p10-12) 29)
	(= (time-to-walk p10-12 s10) 29)
	(= (time-to-walk s12 p10-12) 29)
	(= (time-to-walk p10-12 s12) 29)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 39)
	(= (time-to-drive s2 s0) 39)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 94)
	(= (time-to-drive s3 s0) 94)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 28)
	(= (time-to-drive s4 s0) 28)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 2)
	(= (time-to-drive s6 s0) 2)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 79)
	(= (time-to-drive s3 s1) 79)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 3)
	(= (time-to-drive s4 s1) 3)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 91)
	(= (time-to-drive s5 s1) 91)
	(link s1 s8)
	(link s8 s1)
	(= (time-to-drive s1 s8) 60)
	(= (time-to-drive s8 s1) 60)
	(link s1 s12)
	(link s12 s1)
	(= (time-to-drive s1 s12) 29)
	(= (time-to-drive s12 s1) 29)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 7)
	(= (time-to-drive s4 s2) 7)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 87)
	(= (time-to-drive s8 s2) 87)
	(link s2 s9)
	(link s9 s2)
	(= (time-to-drive s2 s9) 26)
	(= (time-to-drive s9 s2) 26)
	(link s2 s11)
	(link s11 s2)
	(= (time-to-drive s2 s11) 100)
	(= (time-to-drive s11 s2) 100)
	(link s3 s11)
	(link s11 s3)
	(= (time-to-drive s3 s11) 90)
	(= (time-to-drive s11 s3) 90)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 73)
	(= (time-to-drive s3 s4) 73)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 35)
	(= (time-to-drive s8 s4) 35)
	(link s4 s11)
	(link s11 s4)
	(= (time-to-drive s4 s11) 35)
	(= (time-to-drive s11 s4) 35)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 74)
	(= (time-to-drive s2 s5) 74)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 45)
	(= (time-to-drive s6 s5) 45)
	(link s5 s11)
	(link s11 s5)
	(= (time-to-drive s5 s11) 68)
	(= (time-to-drive s11 s5) 68)
	(link s5 s12)
	(link s12 s5)
	(= (time-to-drive s5 s12) 1)
	(= (time-to-drive s12 s5) 1)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 23)
	(= (time-to-drive s2 s6) 23)
	(link s6 s10)
	(link s10 s6)
	(= (time-to-drive s6 s10) 70)
	(= (time-to-drive s10 s6) 70)
	(link s6 s12)
	(link s12 s6)
	(= (time-to-drive s6 s12) 65)
	(= (time-to-drive s12 s6) 65)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 5)
	(= (time-to-drive s0 s7) 5)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 56)
	(= (time-to-drive s3 s7) 56)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 85)
	(= (time-to-drive s4 s7) 85)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 82)
	(= (time-to-drive s8 s7) 82)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 69)
	(= (time-to-drive s9 s7) 69)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 14)
	(= (time-to-drive s6 s8) 14)
	(link s8 s12)
	(link s12 s8)
	(= (time-to-drive s8 s12) 10)
	(= (time-to-drive s12 s8) 10)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 7)
	(= (time-to-drive s3 s9) 7)
	(link s9 s4)
	(link s4 s9)
	(= (time-to-drive s9 s4) 7)
	(= (time-to-drive s4 s9) 7)
	(link s9 s6)
	(link s6 s9)
	(= (time-to-drive s9 s6) 38)
	(= (time-to-drive s6 s9) 38)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 9)
	(= (time-to-drive s7 s10) 9)
	(link s11 s7)
	(link s7 s11)
	(= (time-to-drive s11 s7) 86)
	(= (time-to-drive s7 s11) 86)
	(link s11 s12)
	(link s12 s11)
	(= (time-to-drive s11 s12) 40)
	(= (time-to-drive s12 s11) 40)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver3 s9)
	(at truck2 s3)
	(at truck4 s5)
	(at package1 s5)
	(at package2 s12)
	(at package3 s4)
	(at package4 s3)
	(at package5 s3)
	(at package6 s9)
	))

(:metric minimize (+ (+ (* 4  (total-time)) (* 2  (driven))) (* 3  (walked))))

)

; plan
1. (walk driver2 s5 p5-6)
   deleted: (at driver2 s5)
   added: (at driver2 p5-6)
   changed: (walked) from 0 to 75
   goals met: 1 of 10
2. (load-truck package3 truck2 s6)
   deleted: (at package3 s6)
   added: (in package3 truck2)
   goals met: 1 of 10
3. (walk driver2 p5-6 s6)
   deleted: (at driver2 p5-6)
   added: (at driver2 s6)
   changed: (walked) from 75 to 164
   goals met: 1 of 10
4. (walk driver1 s7 p5-7)
   deleted: (at driver1 s7)
   added: (at driver1 p5-7)
   changed: (walked) from 164 to 191
   goals met: 1 of 10
5. (load-truck package5 truck2 s6)
   deleted: (at package5 s6)
   added: (in package5 truck2)
   goals met: 1 of 10
6. (walk driver1 p5-7 s5)
   deleted: (at driver1 p5-7)
   added: (at driver1 s5)
   changed: (walked) from 191 to 272
   goals met: 1 of 10
7. (board-truck driver2 truck2 s6)
   deleted: (at driver2 s6) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 1 of 10
8. (drive-truck truck2 s6 s5 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s5)
   changed: (driven) from 0 to 45
   goals met: 1 of 10
9. (drive-truck truck2 s5 s11 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s11)
   changed: (driven) from 45 to 113
   goals met: 1 of 10
10. (load-truck package1 truck2 s11)
   deleted: (at package1 s11)
   added: (in package1 truck2)
   goals met: 1 of 10
11. (drive-truck truck2 s11 s4 driver2)
   deleted: (at truck2 s11)
   added: (at truck2 s4)
   changed: (driven) from 113 to 148
   goals met: 1 of 10
12. (unload-truck package3 truck2 s4)
   deleted: (in package3 truck2)
   added: (at package3 s4)
   goals met: 2 of 10
13. (walk driver1 s5 p3-5)
   deleted: (at driver1 s5)
   added: (at driver1 p3-5)
   changed: (walked) from 272 to 357
   goals met: 2 of 10
14. (walk driver1 p3-5 s3)
   deleted: (at driver1 p3-5)
   added: (at driver1 s3)
   changed: (walked) from 357 to 362
   goals met: 2 of 10
15. (walk driver1 s3 p0-3)
   deleted: (at driver1 s3)
   added: (at driver1 p0-3)
   changed: (walked) from 362 to 417
   goals met: 2 of 10
16. (walk driver1 p0-3 s0)
   deleted: (at driver1 p0-3)
   added: (at driver1 s0)
   changed: (walked) from 417 to 460
   goals met: 3 of 10
17. (drive-truck truck2 s4 s3 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   changed: (driven) from 148 to 221
   goals met: 4 of 10
18. (walk driver1 s0 p4-0)
   deleted: (at driver1 s0)
   added: (at driver1 p4-0)
   changed: (walked) from 460 to 486
   goals met: 3 of 10
19. (walk driver1 p4-0 s4)
   deleted: (at driver1 p4-0)
   added: (at driver1 s4)
   changed: (walked) from 486 to 538
   goals met: 3 of 10
20. (unload-truck package5 truck2 s3)
   deleted: (in package5 truck2)
   added: (at package5 s3)
   goals met: 4 of 10
21. (board-truck driver1 truck4 s4)
   deleted: (at driver1 s4) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 4 of 10
22. (drive-truck truck4 s4 s0 driver1)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   changed: (driven) from 221 to 249
   goals met: 4 of 10
23. (disembark-truck driver1 truck4 s0)
   deleted: (driving driver1 truck4)
   added: (at driver1 s0) (empty truck4)
   goals met: 5 of 10
24. (drive-truck truck2 s3 s7 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s7)
   changed: (driven) from 249 to 305
   goals met: 4 of 10
25. (load-truck package2 truck2 s7)
   deleted: (at package2 s7)
   added: (in package2 truck2)
   goals met: 4 of 10
26. (drive-truck truck2 s7 s11 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s11)
   changed: (driven) from 305 to 391
   goals met: 4 of 10
27. (drive-truck truck2 s11 s5 driver2)
   deleted: (at truck2 s11)
   added: (at truck2 s5)
   changed: (driven) from 391 to 459
   goals met: 4 of 10
28. (unload-truck package1 truck2 s5)
   deleted: (in package1 truck2)
   added: (at package1 s5)
   goals met: 5 of 10
29. (drive-truck truck2 s5 s12 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s12)
   changed: (driven) from 459 to 460
   goals met: 5 of 10
30. (unload-truck package2 truck2 s12)
   deleted: (in package2 truck2)
   added: (at package2 s12)
   goals met: 6 of 10
31. (drive-truck truck2 s12 s11 driver2)
   deleted: (at truck2 s12)
   added: (at truck2 s11)
   changed: (driven) from 460 to 500
   goals met: 6 of 10
32. (drive-truck truck2 s11 s3 driver2)
   deleted: (at truck2 s11)
   added: (at truck2 s3)
   changed: (driven) from 500 to 590
   goals met: 7 of 10
33. (disembark-truck driver2 truck2 s3)
   deleted: (driving driver2 truck2)
   added: (at driver2 s3) (empty truck2)
   goals met: 7 of 10
34. (walk driver3 s11 p7-11)
   deleted: (at driver3 s11)
   added: (at driver3 p7-11)
   changed: (walked) from 538 to 549
   goals met: 7 of 10
35. (walk driver3 p7-11 s7)
   deleted: (at driver3 p7-11)
   added: (at driver3 s7)
   changed: (walked) from 549 to 551
   goals met: 7 of 10
36. (board-truck driver2 truck2 s3)
   deleted: (at driver2 s3) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 7 of 10
37. (drive-truck truck2 s3 s9 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s9)
   changed: (driven) from 590 to 597
   goals met: 6 of 10
38. (load-truck package4 truck2 s9)
   deleted: (at package4 s9)
   added: (in package4 truck2)
   goals met: 6 of 10
39. (drive-truck truck2 s9 s3 driver2)
   deleted: (at truck2 s9)
   added: (at truck2 s3)
   changed: (driven) from 597 to 604
   goals met: 7 of 10
40. (unload-truck package4 truck2 s3)
   deleted: (in package4 truck2)
   added: (at package4 s3)
   goals met: 8 of 10
41. (board-truck driver1 truck4 s0)
   deleted: (at driver1 s0) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 7 of 10
42. (disembark-truck driver2 truck2 s3)
   deleted: (driving driver2 truck2)
   added: (at driver2 s3) (empty truck2)
   goals met: 7 of 10
43. (drive-truck truck4 s0 s7 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s7)
   changed: (driven) from 604 to 609
   goals met: 7 of 10
44. (disembark-truck driver1 truck4 s7)
   deleted: (driving driver1 truck4)
   added: (at driver1 s7) (empty truck4)
   goals met: 7 of 10
45. (board-truck driver3 truck4 s7)
   deleted: (at driver3 s7) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 7 of 10
46. (drive-truck truck4 s7 s9 driver3)
   deleted: (at truck4 s7)
   added: (at truck4 s9)
   changed: (driven) from 609 to 678
   goals met: 7 of 10
47. (drive-truck truck4 s9 s6 driver3)
   deleted: (at truck4 s9)
   added: (at truck4 s6)
   changed: (driven) from 678 to 716
   goals met: 7 of 10
48. (walk driver1 s7 p7-11)
   deleted: (at driver1 s7)
   added: (at driver1 p7-11)
   changed: (walked) from 551 to 553
   goals met: 7 of 10
49. (board-truck driver2 truck2 s3)
   deleted: (at driver2 s3) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 7 of 10
50. (drive-truck truck2 s3 s0 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (driven) from 716 to 810
   goals met: 6 of 10
51. (drive-truck truck4 s6 s9 driver3)
   deleted: (at truck4 s6)
   added: (at truck4 s9)
   changed: (driven) from 810 to 848
   goals met: 6 of 10
52. (disembark-truck driver3 truck4 s9)
   deleted: (driving driver3 truck4)
   added: (at driver3 s9) (empty truck4)
   goals met: 7 of 10
53. (drive-truck truck2 s0 s7 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s7)
   changed: (driven) from 848 to 853
   goals met: 7 of 10
54. (disembark-truck driver2 truck2 s7)
   deleted: (driving driver2 truck2)
   added: (at driver2 s7) (empty truck2)
   goals met: 7 of 10
55. (board-truck driver3 truck4 s9)
   deleted: (at driver3 s9) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 6 of 10
56. (drive-truck truck4 s9 s6 driver3)
   deleted: (at truck4 s9)
   added: (at truck4 s6)
   changed: (driven) from 853 to 891
   goals met: 6 of 10
57. (drive-truck truck4 s6 s5 driver3)
   deleted: (at truck4 s6)
   added: (at truck4 s5)
   changed: (driven) from 891 to 936
   goals met: 7 of 10
58. (board-truck driver2 truck2 s7)
   deleted: (at driver2 s7) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 7 of 10
59. (disembark-truck driver3 truck4 s5)
   deleted: (driving driver3 truck4)
   added: (at driver3 s5) (empty truck4)
   goals met: 7 of 10
60. (walk driver3 s5 p5-2)
   deleted: (at driver3 s5)
   added: (at driver3 p5-2)
   changed: (walked) from 553 to 617
   goals met: 7 of 10
61. (walk driver3 p5-2 s2)
   deleted: (at driver3 p5-2)
   added: (at driver3 s2)
   changed: (walked) from 617 to 703
   goals met: 7 of 10
62. (walk driver3 s2 p9-2)
   deleted: (at driver3 s2)
   added: (at driver3 p9-2)
   changed: (walked) from 703 to 786
   goals met: 7 of 10
63. (walk driver3 p9-2 s9)
   deleted: (at driver3 p9-2)
   added: (at driver3 s9)
   changed: (walked) from 786 to 850
   goals met: 8 of 10
64. (drive-truck truck2 s7 s3 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s3)
   changed: (driven) from 936 to 992
   goals met: 9 of 10
65. (drive-truck truck2 s3 s11 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s11)
   changed: (driven) from 992 to 1082
   goals met: 8 of 10
66. (walk driver1 p7-11 s7)
   deleted: (at driver1 p7-11)
   added: (at driver1 s7)
   changed: (walked) from 850 to 852
   goals met: 8 of 10
67. (disembark-truck driver2 truck2 s11)
   deleted: (driving driver2 truck2)
   added: (at driver2 s11) (empty truck2)
   goals met: 8 of 10
68. (walk driver1 s7 p5-7)
   deleted: (at driver1 s7)
   added: (at driver1 p5-7)
   changed: (walked) from 852 to 879
   goals met: 8 of 10
69. (walk driver1 p5-7 s5)
   deleted: (at driver1 p5-7)
   added: (at driver1 s5)
   changed: (walked) from 879 to 960
   goals met: 8 of 10
70. (walk driver1 s5 p3-5)
   deleted: (at driver1 s5)
   added: (at driver1 p3-5)
   changed: (walked) from 960 to 1045
   goals met: 8 of 10
71. (board-truck driver2 truck2 s11)
   deleted: (at driver2 s11) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 8 of 10
72. (walk driver1 p3-5 s3)
   deleted: (at driver1 p3-5)
   added: (at driver1 s3)
   changed: (walked) from 1045 to 1050
   goals met: 8 of 10
73. (drive-truck truck2 s11 s3 driver2)
   deleted: (at truck2 s11)
   added: (at truck2 s3)
   changed: (driven) from 1082 to 1172
   goals met: 9 of 10
74. (walk driver1 s3 p0-3)
   deleted: (at driver1 s3)
   added: (at driver1 p0-3)
   changed: (walked) from 1050 to 1105
   goals met: 9 of 10
75. (walk driver1 p0-3 s0)
   deleted: (at driver1 p0-3)
   added: (at driver1 s0)
   changed: (walked) from 1105 to 1148
   goals met: 10 of 10
